import {Section} from "./Components/Table";

const data: Section[] = [
  {
    name: 'Институт и студенты',
    questions: [
      {
        cost: 300,
        text: 'Все ли могут пользоваться крутыми компами?',
        asked: false
      },
      {
        cost: 600,
        text: 'Почему символ Института - панда? Как она вообще появилась?',
        asked: false
      },
      {
        cost: 900,
        text: 'А чего такого крутого в лаборатории, и как она вообще появилась?',
        asked: false
      },
      {
        cost: 1200,
        text: 'Какое направление круче?',
        asked: false
      },
      {
        cost: 1500,
        text: 'Почему получить общежитие так тяжело? Где живут студенты, если не получают его?',
        asked: false
      },
      {
        cost: 1800,
        text: 'Почему так популярен Институт?',
        asked: false
      }
    ]
  },
  {
    name: 'Военная подготовка и стипендии',
    questions: [
      {
        cost: 300,
        text: 'А есть ли военная кафедра? Если да, то как на неё поступить?',
        asked: false
      },
      {
        cost: 600,
        text: 'Подскажите, у вас есть программа специальных стипендий при услоии сдачи ЕГЭ на 280+ баллов? Индивидуальные достижения в этой сумме не учитываются?',
        asked: false
      },
      {
        cost: 900,
        text: 'Расскажите, пожалуйста, какие есть стипендии в Университете?',
        asked: false
      },
      {
        cost: 1200,
        text: 'КОТ В МЕШКЕ',
        asked: false
      },
      {
        cost: 1500,
        text: 'Какие программы военной подготовки доступны? Могут ли обучаться девушки?',
        asked: false
      },
      {
        cost: 1800,
        text: 'На программную инженерию такой высокий конкурс... Переживаю, что не пройду, как поступить?',
        asked: false
      }
    ]
  },
  {
    name: 'Трудоустройство и партнёры',
    questions: [
      {
        cost: 300,
        text: 'А можно ли работать во время обучения? Получается ли совмещать?',
        asked: false
      },
      {
        cost: 600,
        text: 'Где работают выпускники?',
        asked: false
      },
      {
        cost: 900,
        text: 'Есть ли международные программы?',
        asked: false
      },
      {
        cost: 1200,
        text: 'Ваш вуз работает с такими известными компаниями как Mail.ru, Яндекс?',
        asked: false
      },
      {
        cost: 1500,
        text: 'С какими компаниями сотрудничаете?',
        asked: false
      },
      {
        cost: 1800,
        text: 'Помогает ли вуз с трудоустройством?',
        asked: false
      }
    ]
  },
  {
    name: 'Учебный процесс и возможности',
    questions: [
      {
        cost: 300,
        text: 'Как определить, в каком корпусе будешь учиться?',
        asked: false
      },
      {
        cost: 600,
        text: 'Оплачивает ли Институт участие в конференциях и хакатонах?',
        asked: false
      },
      {
        cost: 900,
        text: 'Расскажите, пожалуйста, о балльно-рейтинговой системе в ИИТ. Как она работает и на что влияет?',
        asked: false
      },
      {
        cost: 1200,
        text: 'Какие языки программирования изучаются?',
        asked: false
      },
      {
        cost: 1500,
        text: 'А что делать, если ты уже знаешь какой-либо язык программирования на уровне "могу идти на работу"? Как быть в этой ситуации и договариваться с преподами?',
        asked: false
      },
      {
        cost: 1800,
        text: 'Часто слышал упоминание групп элитной подготовки? Что это такое?',
        asked: false
      }
    ]
  },
];

export default data;
